fixtures/vcr_cassettes/create_invoice_item_2.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.stripe.com/v1/invoiceitems
    body:
      encoding: UTF-8
      string: customer=cus_9tF6jGg7gVQ9UE&amount=3881&currency=usd&description=Charge+for+upgrading+from+Advanced+Plan+to+Premium+Plan&subscription=sub_9tFF6L9xWHWrcx
    headers:
      Accept:
      - "*/*"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.55.0
      Authorization:
      - Bearer sk_test_1edJffGpWL6BsWNjzicAe9R2
      Content-Type:
      - application/x-www-form-urlencoded
      Idempotency-Key:
      - fd087530-a2d9-4796-b117-c68d194cccaf
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.55.0","lang":"ruby","lang_version":"2.3.1 p112 (2016-04-26)","platform":"x86_64-darwin15","engine":"ruby","publisher":"stripe","uname":"Darwin
        Ricardos-MBP 15.2.0 Darwin Kernel Version 15.2.0: Fri Nov 13 19:56:56 PST
        2015; root:xnu-3248.20.55~2/RELEASE_X86_64 x86_64","hostname":"Ricardos-MBP"}'
      Content-Length:
      - '152'
      Host:
      - api.stripe.com
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Sat, 07 Jan 2017 22:34:57 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '488'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Idempotency-Key:
      - fd087530-a2d9-4796-b117-c68d194cccaf
      Original-Request:
      - req_9tFG1BPHBcobm9
      Request-Id:
      - req_9tFG1BPHBcobm9
      Stripe-Version:
      - '2016-07-06'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "ii_19ZSm5J5yqT11PpPKyj3yJzu",
          "object": "invoiceitem",
          "amount": 3881,
          "currency": "usd",
          "customer": "cus_9tF6jGg7gVQ9UE",
          "date": 1483828497,
          "description": "Charge for upgrading from Advanced Plan to Premium Plan",
          "discountable": true,
          "invoice": null,
          "livemode": false,
          "metadata": {},
          "period": {
            "start": 1483828497,
            "end": 1483828497
          },
          "plan": null,
          "proration": false,
          "quantity": null,
          "subscription": "sub_9tFF6L9xWHWrcx"
        }
    http_version: 
  recorded_at: Sat, 07 Jan 2017 22:34:57 GMT
recorded_with: VCR 3.0.3
