fixtures/vcr_cassettes/downgrade_to_basic.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.stripe.com/v1/subscriptions/sub_9ocs7qFawW9xgW
    body:
      encoding: UTF-8
      string: plan=basic&prorate=true
    headers:
      Accept:
      - "*/*"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.55.0
      Authorization:
      - Bearer sk_test_1edJffGpWL6BsWNjzicAe9R2
      Content-Type:
      - application/x-www-form-urlencoded
      Idempotency-Key:
      - 61cb4c92-2632-44c7-99f6-24e4f0639ebb
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.55.0","lang":"ruby","lang_version":"2.3.1 p112 (2016-04-26)","platform":"x86_64-darwin15","engine":"ruby","publisher":"stripe","uname":"Darwin
        Ricardos-MBP 15.2.0 Darwin Kernel Version 15.2.0: Fri Nov 13 19:56:56 PST
        2015; root:xnu-3248.20.55~2/RELEASE_X86_64 x86_64","hostname":"Ricardos-MBP"}'
      Content-Length:
      - '23'
      Host:
      - api.stripe.com
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Mon, 26 Dec 2016 16:16:09 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '801'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Idempotency-Key:
      - 61cb4c92-2632-44c7-99f6-24e4f0639ebb
      Original-Request:
      - req_9oeRJJq1palGNK
      Request-Id:
      - req_9oeRJJq1palGNK
      Stripe-Version:
      - '2016-07-06'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "sub_9ocs7qFawW9xgW",
          "object": "subscription",
          "application_fee_percent": null,
          "cancel_at_period_end": false,
          "canceled_at": null,
          "created": 1482763110,
          "current_period_end": 1485441510,
          "current_period_start": 1482763110,
          "customer": "cus_9ocs3rYFHe3tdX",
          "discount": null,
          "ended_at": null,
          "livemode": false,
          "metadata": {},
          "plan": {
            "id": "basic",
            "object": "plan",
            "amount": 2900,
            "created": 1468799116,
            "currency": "usd",
            "interval": "month",
            "interval_count": 1,
            "livemode": false,
            "metadata": {},
            "name": "Basic",
            "statement_descriptor": null,
            "trial_period_days": null
          },
          "quantity": 1,
          "start": 1482768968,
          "status": "active",
          "tax_percent": null,
          "trial_end": null,
          "trial_start": null
        }
    http_version: 
  recorded_at: Mon, 26 Dec 2016 16:16:09 GMT
recorded_with: VCR 3.0.3
