fixtures/vcr_cassettes/upcoming_invoice_items_3.yml

---
http_interactions:
- request:
    method: get
    uri: https://api.stripe.com/v1/invoiceitems?customer=cus_9ocs3rYFHe3tdX
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - "*/*"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.55.0
      Authorization:
      - Bearer sk_test_1edJffGpWL6BsWNjzicAe9R2
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.55.0","lang":"ruby","lang_version":"2.3.1 p112 (2016-04-26)","platform":"x86_64-darwin15","engine":"ruby","publisher":"stripe","uname":"Darwin
        Ricardos-MBP 15.2.0 Darwin Kernel Version 15.2.0: Fri Nov 13 19:56:56 PST
        2015; root:xnu-3248.20.55~2/RELEASE_X86_64 x86_64","hostname":"Ricardos-MBP"}'
      Host:
      - api.stripe.com
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Mon, 26 Dec 2016 16:17:53 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '3033'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_9oeTNjejHhruPU
      Stripe-Version:
      - '2016-07-06'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "object": "list",
          "data": [
            {
              "id": "ii_19V18uJ5yqT11PpPDg36wiiY",
              "object": "invoiceitem",
              "amount": -9878,
              "currency": "usd",
              "customer": "cus_9ocs3rYFHe3tdX",
              "date": 1482768968,
              "description": "Unused time on Premium after 26 Dec 2016",
              "discountable": false,
              "invoice": null,
              "livemode": false,
              "metadata": {},
              "period": {
                "start": 1482768968,
                "end": 1485441510
              },
              "plan": {
                "id": "premium",
                "object": "plan",
                "amount": 9900,
                "created": 1468799820,
                "currency": "usd",
                "interval": "month",
                "interval_count": 1,
                "livemode": false,
                "metadata": {},
                "name": "Premium",
                "statement_descriptor": null,
                "trial_period_days": null
              },
              "proration": true,
              "quantity": 1,
              "subscription": "sub_9ocs7qFawW9xgW"
            },
            {
              "id": "ii_19V18uJ5yqT11PpPHnSFXyJT",
              "object": "invoiceitem",
              "amount": 2894,
              "currency": "usd",
              "customer": "cus_9ocs3rYFHe3tdX",
              "date": 1482768968,
              "description": "Remaining time on Basic after 26 Dec 2016",
              "discountable": false,
              "invoice": null,
              "livemode": false,
              "metadata": {},
              "period": {
                "start": 1482768968,
                "end": 1485441510
              },
              "plan": {
                "id": "basic",
                "object": "plan",
                "amount": 2900,
                "created": 1468799116,
                "currency": "usd",
                "interval": "month",
                "interval_count": 1,
                "livemode": false,
                "metadata": {},
                "name": "Basic",
                "statement_descriptor": null,
                "trial_period_days": null
              },
              "proration": true,
              "quantity": 1,
              "subscription": "sub_9ocs7qFawW9xgW"
            },
            {
              "id": "ii_19V0U8J5yqT11PpPoXaIPGpi",
              "object": "invoiceitem",
              "amount": 5000,
              "currency": "usd",
              "customer": "cus_9ocs3rYFHe3tdX",
              "date": 1482766440,
              "description": "Charge for upgrading from Advanced Plan to Premium Plan",
              "discountable": true,
              "invoice": null,
              "livemode": false,
              "metadata": {},
              "period": {
                "start": 1482766440,
                "end": 1482766440
              },
              "plan": null,
              "proration": false,
              "quantity": null,
              "subscription": "sub_9ocs7qFawW9xgW"
            },
            {
              "id": "ii_19UzjDJ5yqT11PpPxXh0STgh",
              "object": "invoiceitem",
              "amount": 2000,
              "currency": "usd",
              "customer": "cus_9ocs3rYFHe3tdX",
              "date": 1482763531,
              "description": "Charge for upgrading from Basic Plan to Advanced Plan",
              "discountable": true,
              "invoice": null,
              "livemode": false,
              "metadata": {},
              "period": {
                "start": 1482763531,
                "end": 1482763531
              },
              "plan": null,
              "proration": false,
              "quantity": null,
              "subscription": "sub_9ocs7qFawW9xgW"
            }
          ],
          "has_more": false,
          "url": "/v1/invoiceitems"
        }
    http_version: 
  recorded_at: Mon, 26 Dec 2016 16:17:53 GMT
recorded_with: VCR 3.0.3
